#include <iostream>

int main() {
  std::cout << "Hello World!\n";
}
/*

Задача 6. Степень двойки.

Напишите программу, которая проверяет, является ли данное число степенью двойки. Например, степенями двойки являются числа 1, 2, 4, 8, 16, 32 и так далее. Не забудьте, что числа больше чем 2147483647 в переменных типа int недопустимы. Программа должна быть короткой. Решение с ручным перебором всех вариантов через if не будет засчитано.
*/